class ДополнительныеФункции:
    """
    Класс для управления дополнительными функциями игры.

    Attributes:
        cheat_codes_enabled (bool): Флаг, указывающий, включены ли чит-коды.
        multiplayer_enabled (bool): Флаг, указывающий, включен ли режим многопользовательской игры.
    """

    def __init__():
        """
        Функция инициализации дополнительных функций игры.
        """
        cheat_codes_enabled = Ложь
        multiplayer_enabled = Ложь

    def включить_чит_коды():
        """
        Включает чит-коды.
        """
        cheat_codes_enabled = Истина
        вывести("Включены чит-коды.")

    def включить_многопользовательский_режим():
        """
        Включает режим многопользовательской игры.
        """
        multiplayer_enabled = Истина
        вывести("Включен режим многопользовательской игры.")
