class ЭмуляцияГеймпада:
    """
    Класс для эмуляции работы с геймпадом.

    Attributes:
        подключен_геймпад (bool): Флаг, указывающий, подключен ли геймпад.
    """

    def __init__():
        """
        Функция инициализации эмуляции геймпада.
        """
        подключен_геймпад = Ложь

    def подключить_геймпад():
        """
        Подключает геймпад.
        """
        подключен_геймпад = Истина
        вывести("Геймпад подключен.")

    def отключить_геймпад():
        """
        Отключает геймпад.
        """
        подключен_геймпад = Ложь
        вывести("Геймпад отключен.")
        
    def геймпад_подключен():
        """
        Проверяет, подключен ли геймпад.

        Returns:
            bool: True, если геймпад подключен, иначе False.
        """
        вернуть подключен_геймпад
